nxp-mcuxpresso/mcux-sdk/devices/MKE17Z9/MKE17Z9.h
#define MTBDWT_FCT0_DATAVADDR0_MASK              (0xF000U)
#define MTBDWT_FCT0_DATAVADDR0_SHIFT             (12U)
/*! DATAVADDR0 - Data Value Address 0 */
#define MTBDWT_FCT0_DATAVADDR0(x)                (((uint32_t)(((uint32_t)(x)) << MTBDWT_FCT0_DATAVADDR0_SHIFT)) & MTBDWT_FCT0_DATAVADDR0_MASK)

#define MTBDWT_FCT0_MATCHED_MASK                 (0x1000000U)
#define MTBDWT_FCT0_MATCHED_SHIFT                (24U)
/*! MATCHED - Comparator match
 *  0b0..No match.
 *  0b1..Match occurred.
 */
#define MTBDWT_FCT0_MATCHED(x)                   (((uint32_t)(((uint32_t)(x)) << MTBDWT_FCT0_MATCHED_SHIFT)) & MTBDWT_FCT0_MATCHED_MASK)
/*! @} */

/*! @name COMP1 - DWT Comparator Register */
/*! @{ */

#define MTBDWT_COMP1_COMP_MASK                   (0xFFFFFFFFU)
#define MTBDWT_COMP1_COMP_SHIFT                  (0U)
/*! COMP - Reference value for comparison */
#define MTBDWT_COMP1_COMP(x)                     (((uint32_t)(((uint32_t)(x)) << MTBDWT_COMP1_COMP_SHIFT)) & MTBDWT_COMP1_COMP_MASK)
/*! @} */

/*! @name MASK1 - DWT Comparator Mask Register */
/*! @{ */

#define MTBDWT_MASK1_MASK_MASK                   (0x1FU)
#define MTBDWT_MASK1_MASK_SHIFT                  (0U)
/*! MASK - MASK */
#define MTBDWT_MASK1_MASK(x)                     (((uint32_t)(((uint32_t)(x)) << MTBDWT_MASK1_MASK_SHIFT)) & MTBDWT_MASK1_MASK_MASK)
/*! @} */

/*! @name FCT1 - DWT Comparator Function Register 1 */
/*! @{ */

#define MTBDWT_FCT1_FUNCTION_MASK                (0xFU)
#define MTBDWT_FCT1_FUNCTION_SHIFT               (0U)
/*! FUNCTION - Function
 *  0b0000..Disabled.
 *  0b0001-0b0011..Reserved. Any attempts to use this value results in UNPREDICTABLE behavior.
 *  0b0100..Instruction fetch.
 *  0b0101..Data operand read.
 *  0b0110..Data operand write.
 *  0b0111..Data operand (read + write).
 *  0b1000-0b1111..Reserved. Any attempts to use this value results in UNPREDICTABLE behavior.
 */
#define MTBDWT_FCT1_FUNCTION(x)                  (((uint32_t)(((uint32_t)(x)) << MTBDWT_FCT1_FUNCTION_SHIFT)) & MTBDWT_FCT1_FUNCTION_MASK)

#define MTBDWT_FCT1_MATCHED_MASK                 (0x1000000U)
#define MTBDWT_FCT1_MATCHED_SHIFT                (24U)
/*! MATCHED - Comparator match
 *  0b0..No match.
 *  0b1..Match occurred.
 */
#define MTBDWT_FCT1_MATCHED(x)                   (((uint32_t)(((uint32_t)(x)) << MTBDWT_FCT1_MATCHED_SHIFT)) & MTBDWT_FCT1_MATCHED_MASK)
/*! @} */

/*! @name TBCTRL - DWT Trace Buffer Control Register */
/*! @{ */

#define MTBDWT_TBCTRL_ACOMP0_MASK                (0x1U)
#define MTBDWT_TBCTRL_ACOMP0_SHIFT               (0U)
/*! ACOMP0 - Action based on Comparator 0 match
 *  0b0..Trigger TSTOP based on the assertion of FCT0[MATCHED].
 *  0b1..Trigger TSTART based on the assertion of FCT0[MATCHED].
 */
#define MTBDWT_TBCTRL_ACOMP0(x)                  (((uint32_t)(((uint32_t)(x)) << MTBDWT_TBCTRL_ACOMP0_SHIFT)) & MTBDWT_TBCTRL_ACOMP0_MASK)

#define MTBDWT_TBCTRL_ACOMP1_MASK                (0x2U)
#define MTBDWT_TBCTRL_ACOMP1_SHIFT               (1U)
/*! ACOMP1 - Action based on Comparator 1 match
 *  0b0..Trigger TSTOP based on the assertion of FCT1[MATCHED].
 *  0b1..Trigger TSTART based on the assertion of FCT1[MATCHED].
 */
#define MTBDWT_TBCTRL_ACOMP1(x)                  (((uint32_t)(((uint32_t)(x)) << MTBDWT_TBCTRL_ACOMP1_SHIFT)) & MTBDWT_TBCTRL_ACOMP1_MASK)

#define MTBDWT_TBCTRL_NUMCOMP_MASK               (0xF0000000U)
#define MTBDWT_TBCTRL_NUMCOMP_SHIFT              (28U)
/*! NUMCOMP - Number of Comparators */
#define MTBDWT_TBCTRL_NUMCOMP(x)                 (((uint32_t)(((uint32_t)(x)) << MTBDWT_TBCTRL_NUMCOMP_SHIFT)) & MTBDWT_TBCTRL_NUMCOMP_MASK)
/*! @} */

/*! @name DEVICECFG - Device Configuration Register */
/*! @{ */

#define MTBDWT_DEVICECFG_DEVICECFG_MASK          (0xFFFFFFFFU)
#define MTBDWT_DEVICECFG_DEVICECFG_SHIFT         (0U)
/*! DEVICECFG - DEVICECFG */
#define MTBDWT_DEVICECFG_DEVICECFG(x)            (((uint32_t)(((uint32_t)(x)) << MTBDWT_DEVICECFG_DEVICECFG_SHIFT)) & MTBDWT_DEVICECFG_DEVICECFG_MASK)
/*! @} */

/*! @name DEVICETYPID - Device Type Identifier Register */
/*! @{ */

#define MTBDWT_DEVICETYPID_DEVICETYPID_MASK      (0xFFFFFFFFU)
#define MTBDWT_DEVICETYPID_DEVICETYPID_SHIFT     (0U)
/*! DEVICETYPID - DEVICETYPID */
#define MTBDWT_DEVICETYPID_DEVICETYPID(x)        (((uint32_t)(((uint32_t)(x)) << MTBDWT_DEVICETYPID_DEVICETYPID_SHIFT)) & MTBDWT_DEVICETYPID_DEVICETYPID_MASK)
/*! @} */

/*! @name PERIPHID - Peripheral ID Register */
/*! @{ */

#define MTBDWT_PERIPHID_PERIPHID_MASK            (0xFFFFFFFFU)
#define MTBDWT_PERIPHID_PERIPHID_SHIFT           (0U)
/*! PERIPHID - PERIPHID */
#define MTBDWT_PERIPHID_PERIPHID(x)              (((uint32_t)(((uint32_t)(x)) << MTBDWT_PERIPHID_PERIPHID_SHIFT)) & MTBDWT_PERIPHID_PERIPHID_MASK)
/*! @} */

/* The count of MTBDWT_PERIPHID */
#define MTBDWT_PERIPHID_COUNT                    (8U)

/*! @name COMPID - Component ID Register */
/*! @{ */

#define MTBDWT_COMPID_COMPID_MASK                (0xFFFFFFFFU)
#define MTBDWT_COMPID_COMPID_SHIFT               (0U)
/*! COMPID - Component ID */
#define MTBDWT_COMPID_COMPID(x)                  (((uint32_t)(((uint32_t)(x)) << MTBDWT_COMPID_COMPID_SHIFT)) & MTBDWT_COMPID_COMPID_MASK)
/*! @} */

/* The count of MTBDWT_COMPID */
#define MTBDWT_COMPID_COUNT                      (4U)


/*!
 * @}
 */ /* end of group MTBDWT_Register_Masks */


/* MTBDWT - Peripheral instance base addresses */
/** Peripheral MTBDWT base address */
#define MTBDWT_BASE                              (0xF0001000u)
/** Peripheral MTBDWT base pointer */
#define MTBDWT                                   ((MTBDWT_Type *)MTBDWT_BASE)
/** Array initializer of MTBDWT peripheral base addresses */
#define MTBDWT_BASE_ADDRS                        { MTBDWT_BASE }
/** Array initializer of MTBDWT peripheral base pointers */
#define MTBDWT_BASE_PTRS                         { MTBDWT }

/*!
 * @}
 */ /* end of group MTBDWT_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- MTBDWTROM Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup MTBDWTROM_Peripheral_Access_Layer MTBDWTROM Peripheral Access Layer
 * @{
 */

/** MTBDWTROM - Register Layout Typedef */
typedef struct {
  __I  uint32_t ENTRY[4];                          /**< Entry, array offset: 0x0, array step: 0x4 */
  __I  uint32_t TABLEMARK;                         /**< End of Table Marker Register, offset: 0x10 */
       uint8_t RESERVED_0[4024];
  __I  uint32_t SYSACCESS;                         /**< System Access Register, offset: 0xFCC */
  __I  uint32_t PERIPHID[8];                       /**< Peripheral ID Register, array offset: 0xFD0, array step: 0x4 */
  __I  uint32_t COMPID[4];                         /**< Component ID Register, array offset: 0xFF0, array step: 0x4 */
} MTBDWTROM_Type;

/* ----------------------------------------------------------------------------
   -- MTBDWTROM Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup MTBDWTROM_Register_Masks MTBDWTROM Register Masks
 * @{
 */

/*! @name ENTRY - Entry */
/*! @{ */

#define MTBDWTROM_ENTRY_ENTRY_MASK               (0xFFFFFFFFU)
#define MTBDWTROM_ENTRY_ENTRY_SHIFT              (0U)
/*! ENTRY - ENTRY */
#define MTBDWTROM_ENTRY_ENTRY(x)                 (((uint32_t)(((uint32_t)(x)) << MTBDWTROM_ENTRY_ENTRY_SHIFT)) & MTBDWTROM_ENTRY_ENTRY_MASK)
/*! @} */

/* The count of MTBDWTROM_ENTRY */
#define MTBDWTROM_ENTRY_COUNT                    (4U)

