nxp-mcuxpresso/mcux-sdk/devices/MKE17Z9/MKE17Z9.h
/*! @name TABLEMARK - End of Table Marker Register */
/*! @{ */

#define MTBDWTROM_TABLEMARK_MARK_MASK            (0xFFFFFFFFU)
#define MTBDWTROM_TABLEMARK_MARK_SHIFT           (0U)
/*! MARK - MARK */
#define MTBDWTROM_TABLEMARK_MARK(x)              (((uint32_t)(((uint32_t)(x)) << MTBDWTROM_TABLEMARK_MARK_SHIFT)) & MTBDWTROM_TABLEMARK_MARK_MASK)
/*! @} */

/*! @name SYSACCESS - System Access Register */
/*! @{ */

#define MTBDWTROM_SYSACCESS_SYSACCESS_MASK       (0xFFFFFFFFU)
#define MTBDWTROM_SYSACCESS_SYSACCESS_SHIFT      (0U)
/*! SYSACCESS - SYSACCESS */
#define MTBDWTROM_SYSACCESS_SYSACCESS(x)         (((uint32_t)(((uint32_t)(x)) << MTBDWTROM_SYSACCESS_SYSACCESS_SHIFT)) & MTBDWTROM_SYSACCESS_SYSACCESS_MASK)
/*! @} */

/*! @name PERIPHID - Peripheral ID Register */
/*! @{ */

#define MTBDWTROM_PERIPHID_PERIPHID_MASK         (0xFFFFFFFFU)
#define MTBDWTROM_PERIPHID_PERIPHID_SHIFT        (0U)
/*! PERIPHID - PERIPHID */
#define MTBDWTROM_PERIPHID_PERIPHID(x)           (((uint32_t)(((uint32_t)(x)) << MTBDWTROM_PERIPHID_PERIPHID_SHIFT)) & MTBDWTROM_PERIPHID_PERIPHID_MASK)
/*! @} */

/* The count of MTBDWTROM_PERIPHID */
#define MTBDWTROM_PERIPHID_COUNT                 (8U)

/*! @name COMPID - Component ID Register */
/*! @{ */

#define MTBDWTROM_COMPID_COMPID_MASK             (0xFFFFFFFFU)
#define MTBDWTROM_COMPID_COMPID_SHIFT            (0U)
/*! COMPID - Component ID */
#define MTBDWTROM_COMPID_COMPID(x)               (((uint32_t)(((uint32_t)(x)) << MTBDWTROM_COMPID_COMPID_SHIFT)) & MTBDWTROM_COMPID_COMPID_MASK)
/*! @} */

/* The count of MTBDWTROM_COMPID */
#define MTBDWTROM_COMPID_COUNT                   (4U)


/*!
 * @}
 */ /* end of group MTBDWTROM_Register_Masks */


/* MTBDWTROM - Peripheral instance base addresses */
/** Peripheral MTBDWTROM base address */
#define MTBDWTROM_BASE                           (0xF0002000u)
/** Peripheral MTBDWTROM base pointer */
#define MTBDWTROM                                ((MTBDWTROM_Type *)MTBDWTROM_BASE)
/** Array initializer of MTBDWTROM peripheral base addresses */
#define MTBDWTROM_BASE_ADDRS                     { MTBDWTROM_BASE }
/** Array initializer of MTBDWTROM peripheral base pointers */
#define MTBDWTROM_BASE_PTRS                      { MTBDWTROM }

/*!
 * @}
 */ /* end of group MTBDWTROM_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- NV Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup NV_Peripheral_Access_Layer NV Peripheral Access Layer
 * @{
 */

/** NV - Register Layout Typedef */
typedef struct {
  __I  uint8_t BACKKEY3;                           /**< Backdoor Comparison Key 3., offset: 0x0 */
  __I  uint8_t BACKKEY2;                           /**< Backdoor Comparison Key 2., offset: 0x1 */
  __I  uint8_t BACKKEY1;                           /**< Backdoor Comparison Key 1., offset: 0x2 */
  __I  uint8_t BACKKEY0;                           /**< Backdoor Comparison Key 0., offset: 0x3 */
  __I  uint8_t BACKKEY7;                           /**< Backdoor Comparison Key 7., offset: 0x4 */
  __I  uint8_t BACKKEY6;                           /**< Backdoor Comparison Key 6., offset: 0x5 */
  __I  uint8_t BACKKEY5;                           /**< Backdoor Comparison Key 5., offset: 0x6 */
  __I  uint8_t BACKKEY4;                           /**< Backdoor Comparison Key 4., offset: 0x7 */
  __I  uint8_t FPROT3;                             /**< Non-volatile P-Flash Protection 1 - Low Register, offset: 0x8 */
  __I  uint8_t FPROT2;                             /**< Non-volatile P-Flash Protection 1 - High Register, offset: 0x9 */
  __I  uint8_t FPROT1;                             /**< Non-volatile P-Flash Protection 0 - Low Register, offset: 0xA */
  __I  uint8_t FPROT0;                             /**< Non-volatile P-Flash Protection 0 - High Register, offset: 0xB */
  __I  uint8_t FSEC;                               /**< Non-volatile Flash Security Register, offset: 0xC */
  __I  uint8_t FOPT;                               /**< Non-volatile Flash Option Register, offset: 0xD */
} NV_Type;

/* ----------------------------------------------------------------------------
   -- NV Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup NV_Register_Masks NV Register Masks
 * @{
 */

/*! @name BACKKEY3 - Backdoor Comparison Key 3. */
/*! @{ */

#define NV_BACKKEY3_KEY_MASK                     (0xFFU)
#define NV_BACKKEY3_KEY_SHIFT                    (0U)
/*! KEY - Backdoor Comparison Key. */
#define NV_BACKKEY3_KEY(x)                       (((uint8_t)(((uint8_t)(x)) << NV_BACKKEY3_KEY_SHIFT)) & NV_BACKKEY3_KEY_MASK)
/*! @} */

/*! @name BACKKEY2 - Backdoor Comparison Key 2. */
/*! @{ */

#define NV_BACKKEY2_KEY_MASK                     (0xFFU)
#define NV_BACKKEY2_KEY_SHIFT                    (0U)
/*! KEY - Backdoor Comparison Key. */
#define NV_BACKKEY2_KEY(x)                       (((uint8_t)(((uint8_t)(x)) << NV_BACKKEY2_KEY_SHIFT)) & NV_BACKKEY2_KEY_MASK)
/*! @} */

/*! @name BACKKEY1 - Backdoor Comparison Key 1. */
/*! @{ */

#define NV_BACKKEY1_KEY_MASK                     (0xFFU)
#define NV_BACKKEY1_KEY_SHIFT                    (0U)
/*! KEY - Backdoor Comparison Key. */
#define NV_BACKKEY1_KEY(x)                       (((uint8_t)(((uint8_t)(x)) << NV_BACKKEY1_KEY_SHIFT)) & NV_BACKKEY1_KEY_MASK)
/*! @} */

/*! @name BACKKEY0 - Backdoor Comparison Key 0. */
/*! @{ */

#define NV_BACKKEY0_KEY_MASK                     (0xFFU)
#define NV_BACKKEY0_KEY_SHIFT                    (0U)
/*! KEY - Backdoor Comparison Key. */
#define NV_BACKKEY0_KEY(x)                       (((uint8_t)(((uint8_t)(x)) << NV_BACKKEY0_KEY_SHIFT)) & NV_BACKKEY0_KEY_MASK)
/*! @} */

/*! @name BACKKEY7 - Backdoor Comparison Key 7. */
/*! @{ */

#define NV_BACKKEY7_KEY_MASK                     (0xFFU)
#define NV_BACKKEY7_KEY_SHIFT                    (0U)
/*! KEY - Backdoor Comparison Key. */
#define NV_BACKKEY7_KEY(x)                       (((uint8_t)(((uint8_t)(x)) << NV_BACKKEY7_KEY_SHIFT)) & NV_BACKKEY7_KEY_MASK)
/*! @} */

